{"class_name": "Sequential", "config": {"name": "sequential_3", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 364, 436, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "inception_resnet_v2_input"}}, {"class_name": "Functional", "config": {"name": "inception_resnet_v2", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 364, 436, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_4"}, "name": "input_4", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"name": "conv2d_609", "trainable": false, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_609", "inbound_nodes": [[["input_4", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_609", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_609", "inbound_nodes": [[["conv2d_609", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_609", "trainable": false, "dtype": "float32", "activation": "relu"}, "name": "activation_609", "inbound_nodes": [[["batch_normalization_609", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_610", "trainable": false, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_610", "inbound_nodes": [[["activation_609", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_610", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_610", "inbound_nodes": [[["conv2d_610", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_610", "trainable": false, "dtype": "float32", "activation": "relu"}, "name": "activation_610", "inbound_nodes": [[["batch_normalization_610", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_611", "trainable": false, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_611", "inbound_nodes": [[["activation_610", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_611", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_611", "inbound_nodes": [[["conv2d_611", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_611", "trainable": false, "dtype": "float32", "activation": "relu"}, "name": "activation_611", "inbound_nodes": [[["batch_normalization_611", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_12", "trainable": false, "dtype": "float32", "pool_size": [3, 3], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_12", "inbound_nodes": [[["activation_611", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_612", "trainable": false, "dtype": "float32", "filters": 80, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_612", "inbound_nodes": [[["max_pooling2d_12", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_612", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_612", "inbound_nodes": [[["conv2d_612", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_612", "trainable": false, "dtype": "float32", "activation": "relu"}, "name": "activation_612", "inbound_nodes": [[["batch_normalization_612", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_613", "trainable": false, "dtype": "float32", "filters": 192, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_613", "inbound_nodes": [[["activation_612", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_613", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_613", "inbound_nodes": [[["conv2d_613", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_613", "trainable": false, "dtype": "float32", "activation": "relu"}, "name": "activation_613", "inbound_nodes": [[["batch_normalization_613", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_13", "trainable": false, "dtype": "float32", "pool_size": [3, 3], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_13", "inbound_nodes": [[["activation_613", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_617", "trainable": false, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_617", "inbound_nodes": [[["max_pooling2d_13", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_617", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_617", "inbound_nodes": [[["conv2d_617", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_617", "trainable": false, "dtype": "float32", "activation": "relu"}, "name": "activation_617", "inbound_nodes": [[["batch_normalization_617", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_615", "trainable": false, "dtype": "float32", "filters": 48, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_615", "inbound_nodes": [[["max_pooling2d_13", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_618", "trainable": false, "dtype": "float32", "filters": 96, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_618", "inbound_nodes": [[["activation_617", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_615", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_615", "inbound_nodes": [[["conv2d_615", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_618", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_618", "inbound_nodes": [[["conv2d_618", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_615", "trainable": false, "dtype": "float32", "activation": "relu"}, "name": "activation_615", "inbound_nodes": [[["batch_normalization_615", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_618", "trainable": false, "dtype": "float32", "activation": "relu"}, "name": "activation_618", "inbound_nodes": [[["batch_normalization_618", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_3", "trainable": false, "dtype": "float32", "pool_size": [3, 3], "padding": "same", "strides": [1, 1], "data_format": "channels_last"}, "name": "average_pooling2d_3", "inbound_nodes": [[["max_pooling2d_13", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_614", "trainable": false, "dtype": "float32", "filters": 96, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_614", "inbound_nodes": [[["max_pooling2d_13", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_616", "trainable": false, "dtype": "float32", "filters": 64, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_616", "inbound_nodes": [[["activation_615", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_619", "trainable": false, "dtype": "float32", "filters": 96, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_619", "inbound_nodes": [[["activation_618", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_620", "trainable": false, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_620", "inbound_nodes": [[["average_pooling2d_3", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_614", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_614", "inbound_nodes": [[["conv2d_614", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_616", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_616", "inbound_nodes": [[["conv2d_616", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_619", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_619", "inbound_nodes": [[["conv2d_619", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_620", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_620", "inbound_nodes": [[["conv2d_620", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_614", "trainable": false, "dtype": "float32", "activation": "relu"}, "name": "activation_614", "inbound_nodes": [[["batch_normalization_614", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_616", "trainable": false, "dtype": "float32", "activation": "relu"}, "name": "activation_616", "inbound_nodes": [[["batch_normalization_616", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_619", "trainable": false, "dtype": "float32", "activation": "relu"}, "name": "activation_619", "inbound_nodes": [[["batch_normalization_619", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_620", "trainable": false, "dtype": "float32", "activation": "relu"}, "name": "activation_620", "inbound_nodes": [[["batch_normalization_620", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "mixed_5b", "trainable": false, "dtype": "float32", "axis": 3}, "name": "mixed_5b", "inbound_nodes": [[["activation_614", 0, 0, {}], ["activation_616", 0, 0, {}], ["activation_619", 0, 0, {}], ["activation_620", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_624", "trainable": false, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_624", "inbound_nodes": [[["mixed_5b", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_624", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_624", "inbound_nodes": [[["conv2d_624", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_624", "trainable": false, "dtype": "float32", "activation": "relu"}, "name": "activation_624", "inbound_nodes": [[["batch_normalization_624", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_622", "trainable": false, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_622", "inbound_nodes": [[["mixed_5b", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_625", "trainable": false, "dtype": "float32", "filters": 48, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_625", "inbound_nodes": [[["activation_624", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_622", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_622", "inbound_nodes": [[["conv2d_622", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_625", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_625", "inbound_nodes": [[["conv2d_625", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_622", "trainable": false, "dtype": "float32", "activation": "relu"}, "name": "activation_622", "inbound_nodes": [[["batch_normalization_622", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_625", "trainable": false, "dtype": "float32", "activation": "relu"}, "name": "activation_625", "inbound_nodes": [[["batch_normalization_625", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_621", "trainable": false, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_621", "inbound_nodes": [[["mixed_5b", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_623", "trainable": false, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_623", "inbound_nodes": [[["activation_622", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_626", "trainable": false, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_626", "inbound_nodes": [[["activation_625", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_621", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_621", "inbound_nodes": [[["conv2d_621", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_623", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_623", "inbound_nodes": [[["conv2d_623", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_626", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_626", "inbound_nodes": [[["conv2d_626", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_621", "trainable": false, "dtype": "float32", "activation": "relu"}, "name": "activation_621", "inbound_nodes": [[["batch_normalization_621", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_623", "trainable": false, "dtype": "float32", "activation": "relu"}, "name": "activation_623", "inbound_nodes": [[["batch_normalization_623", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_626", "trainable": false, "dtype": "float32", "activation": "relu"}, "name": "activation_626", "inbound_nodes": [[["batch_normalization_626", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "block35_1_mixed", "trainable": false, "dtype": "float32", "axis": 3}, "name": "block35_1_mixed", "inbound_nodes": [[["activation_621", 0, 0, {}], ["activation_623", 0, 0, {}], ["activation_626", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block35_1_conv", "trainable": false, "dtype": "float32", "filters": 320, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block35_1_conv", "inbound_nodes": [[["block35_1_mixed", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "block35_1", "trainable": false, "dtype": "float32", "function": ["4wIAAAAAAAAAAgAAAAMAAABTAAAAcxQAAAB8AGQBGQB8AGQCGQB8ARQAFwBTACkDTukAAAAA6QEA\nAACpACkC2gZpbnB1dHPaBXNjYWxlcgMAAAByAwAAAPpiL3Vzci9sb2NhbC9saWIvcHl0aG9uMy42\nL2Rpc3QtcGFja2FnZXMvdGVuc29yZmxvdy9weXRob24va2VyYXMvYXBwbGljYXRpb25zL2luY2Vw\ndGlvbl9yZXNuZXRfdjIucHnaCDxsYW1iZGE+dAEAAPMAAAAA\n", null, null], "function_type": "lambda", "module": "tensorflow.python.keras.applications.inception_resnet_v2", "output_shape": [43, 52, 320], "output_shape_type": "raw", "output_shape_module": null, "arguments": {"scale": 0.17}}, "name": "block35_1", "inbound_nodes": [[["mixed_5b", 0, 0, {}], ["block35_1_conv", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "block35_1_ac", "trainable": false, "dtype": "float32", "activation": "relu"}, "name": "block35_1_ac", "inbound_nodes": [[["block35_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_630", "trainable": false, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_630", "inbound_nodes": [[["block35_1_ac", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_630", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_630", "inbound_nodes": [[["conv2d_630", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_630", "trainable": false, "dtype": "float32", "activation": "relu"}, "name": "activation_630", "inbound_nodes": [[["batch_normalization_630", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_628", "trainable": false, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_628", "inbound_nodes": [[["block35_1_ac", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_631", "trainable": false, "dtype": "float32", "filters": 48, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_631", "inbound_nodes": [[["activation_630", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_628", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_628", "inbound_nodes": [[["conv2d_628", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_631", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_631", "inbound_nodes": [[["conv2d_631", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_628", "trainable": false, "dtype": "float32", "activation": "relu"}, "name": "activation_628", "inbound_nodes": [[["batch_normalization_628", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_631", "trainable": false, "dtype": "float32", "activation": "relu"}, "name": "activation_631", "inbound_nodes": [[["batch_normalization_631", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_627", "trainable": false, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_627", "inbound_nodes": [[["block35_1_ac", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_629", "trainable": false, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_629", "inbound_nodes": [[["activation_628", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_632", "trainable": false, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_632", "inbound_nodes": [[["activation_631", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_627", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_627", "inbound_nodes": [[["conv2d_627", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_629", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_629", "inbound_nodes": [[["conv2d_629", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_632", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_632", "inbound_nodes": [[["conv2d_632", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_627", "trainable": false, "dtype": "float32", "activation": "relu"}, "name": "activation_627", "inbound_nodes": [[["batch_normalization_627", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_629", "trainable": false, "dtype": "float32", "activation": "relu"}, "name": "activation_629", "inbound_nodes": [[["batch_normalization_629", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_632", "trainable": false, "dtype": "float32", "activation": "relu"}, "name": "activation_632", "inbound_nodes": [[["batch_normalization_632", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "block35_2_mixed", "trainable": false, "dtype": "float32", "axis": 3}, "name": "block35_2_mixed", "inbound_nodes": [[["activation_627", 0, 0, {}], ["activation_629", 0, 0, {}], ["activation_632", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block35_2_conv", "trainable": false, "dtype": "float32", "filters": 320, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block35_2_conv", "inbound_nodes": [[["block35_2_mixed", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "block35_2", "trainable": false, "dtype": "float32", "function": ["4wIAAAAAAAAAAgAAAAMAAABTAAAAcxQAAAB8AGQBGQB8AGQCGQB8ARQAFwBTACkDTukAAAAA6QEA\nAACpACkC2gZpbnB1dHPaBXNjYWxlcgMAAAByAwAAAPpiL3Vzci9sb2NhbC9saWIvcHl0aG9uMy42\nL2Rpc3QtcGFja2FnZXMvdGVuc29yZmxvdy9weXRob24va2VyYXMvYXBwbGljYXRpb25zL2luY2Vw\ndGlvbl9yZXNuZXRfdjIucHnaCDxsYW1iZGE+dAEAAPMAAAAA\n", null, null], "function_type": "lambda", "module": "tensorflow.python.keras.applications.inception_resnet_v2", "output_shape": [43, 52, 320], "output_shape_type": "raw", "output_shape_module": null, "arguments": {"scale": 0.17}}, "name": "block35_2", "inbound_nodes": [[["block35_1_ac", 0, 0, {}], ["block35_2_conv", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "block35_2_ac", "trainable": false, "dtype": "float32", "activation": "relu"}, "name": "block35_2_ac", "inbound_nodes": [[["block35_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_636", "trainable": false, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_636", "inbound_nodes": [[["block35_2_ac", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_636", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_636", "inbound_nodes": [[["conv2d_636", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_636", "trainable": false, "dtype": "float32", "activation": "relu"}, "name": "activation_636", "inbound_nodes": [[["batch_normalization_636", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_634", "trainable": false, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_634", "inbound_nodes": [[["block35_2_ac", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_637", "trainable": false, "dtype": "float32", "filters": 48, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_637", "inbound_nodes": [[["activation_636", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_634", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_634", "inbound_nodes": [[["conv2d_634", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_637", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_637", "inbound_nodes": [[["conv2d_637", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_634", "trainable": false, "dtype": "float32", "activation": "relu"}, "name": "activation_634", "inbound_nodes": [[["batch_normalization_634", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_637", "trainable": false, "dtype": "float32", "activation": "relu"}, "name": "activation_637", "inbound_nodes": [[["batch_normalization_637", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_633", "trainable": false, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_633", "inbound_nodes": [[["block35_2_ac", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_635", "trainable": false, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_635", "inbound_nodes": [[["activation_634", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_638", "trainable": false, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_638", "inbound_nodes": [[["activation_637", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_633", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_633", "inbound_nodes": [[["conv2d_633", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_635", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_635", "inbound_nodes": [[["conv2d_635", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_638", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_638", "inbound_nodes": [[["conv2d_638", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_633", "trainable": false, "dtype": "float32", "activation": "relu"}, "name": "activation_633", "inbound_nodes": [[["batch_normalization_633", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_635", "trainable": false, "dtype": "float32", "activation": "relu"}, "name": "activation_635", 